app/controllers/filmes_controller.rb

SELECT "filmes".* FROM "filmes"
---
    def index
        @filmes = Filme.all

INSERT INTO "filmes" ("nome", "data_lancamento", "descricao", "created_at", "updated_at", "diretor") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nome", "teste"], ["data_lancamento", "2021-06-23"], ["descricao", "ablublue"], ["created_at", "2021-06-23 17:42:11.527486"], ["updated_at", "2021-06-23 17:42:11.527486"], ["diretor", "aaaa"]]
---
    def create
        @filme = Filme.new(filme_params)
        if @filme.save

UPDATE "filmes" SET "nome" = $1, "descricao" = $2, "updated_at" = $3 WHERE "filmes"."id" = $4
---
    def update
        if @filme.update(filme_params)

DELETE FROM "filmes" WHERE "filmes"."id" = $1  [["id", 4]]
SELECT "filmes".* FROM "filmes" WHERE "filmes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def destroy
        @filme.destroy
        redirect_to filmes_path
    end

    private def set_filme
        @filme = Filme.find(params[:id])